In [1]:
import pandas as pd

# Two main data types

## 1. Series

In [2]:
series = pd.Series(["BMW","Toyota","Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

### Series is 1-D (one dimensional)

## 2. data frame

### Series is 2-D (two dimensional)

In [4]:
car_data = pd.DataFrame({"Car make":series,"color":["red", "blue", "red"]})

In [5]:
car_data

  Car make color
0      BMW   red
1   Toyota  blue
2    Honda   red

# Importing the data

In [6]:
car_sales = pd.read_csv('car-sales.csv')

In [7]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## In pandas data frame data
## Column : axis = 1
## Row : axis = 0

# Exporting the data frame

In [8]:
car_sales.to_csv('exported-car-sales.csv')
pd.read_csv("exported-car-sales.csv")

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [9]:
car_sales.to_csv('exported-car-sales.csv',index=False)
pd.read_csv("exported-car-sales.csv")

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# Describe data

In [10]:
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [11]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [12]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [13]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [14]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [15]:
car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [16]:
type(car_sales['Doors'])

pandas.core.series.Series

In [17]:
car_sales['Doors'].mean()

4.0

In [18]:
car_sales['Doors'].sum()

40

In [19]:
len(car_sales)

10

# Viewing and selecting data

In [20]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [23]:
car_sales.head(3)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [22]:
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [24]:
car_sales.tail(3)

     Make Colour  Odometer (KM)  Doors      Price
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

## .loc and .iloc

In [25]:
animals = pd.Series(['cat','dog','bird','panda','snake'],
            index = [0    , 3   , 9    , 8     , 3     ])

In [26]:
animals

0      cat
3      dog
9     bird
8    panda
3    snake
dtype: object

In [27]:
animals.loc[3] # loc : location

3      dog
3    snake
dtype: object

In [29]:
animals.loc[9]

'bird'

In [28]:
animals.iloc[3] # iloc : index location (real position)

'panda'

In [33]:
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [30]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [31]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [35]:
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [48]:
car_sales.iloc[-1::-1] # [start:end:step]

     Make Colour  Odometer (KM)  Doors       Price
9  Nissan  White          31600      4   $9,700.00
8  Toyota  White          60000      4   $6,250.00
7   Honda   Blue          54738      4   $7,000.00
6   Honda   Blue          45698      4   $7,500.00
5  Toyota  Green          99213      4   $4,500.00
4  Nissan  White         213095      4   $3,500.00
3     BMW  Black          11179      5  $22,000.00
2  Toyota   Blue          32549      3   $7,000.00
1   Honda    Red          87899      4   $5,000.00
0  Toyota  White         150043      4   $4,000.00

In [49]:
car_sales.iloc[-1::-1,-1:]

        Price
9   $9,700.00
8   $6,250.00
7   $7,000.00
6   $7,500.00
5   $4,500.00
4   $3,500.00
3  $22,000.00
2   $7,000.00
1   $5,000.00
0   $4,000.00

In [54]:
car_sales['Make'].iloc[-1::-1]

9    Nissan
8    Toyota
7     Honda
6     Honda
5    Toyota
4    Nissan
3       BMW
2    Toyota
1     Honda
0    Toyota
Name: Make, dtype: object

In [55]:
car_sales.Make.iloc[-1::-1]

9    Nissan
8    Toyota
7     Honda
6     Honda
5    Toyota
4    Nissan
3       BMW
2    Toyota
1     Honda
0    Toyota
Name: Make, dtype: object

## Boolean indexing

In [58]:
car_sales[car_sales.Make == 'Toyota']

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [61]:
car_sales[car_sales['Odometer (KM)'] > 100000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00